Revit 2026 API

# BarTerminationsData Class

---

Class that stores data about reinforcement's terminations (e.g. hooks, cranks, end treatments)

SystemObject Autodesk.Revit.DB.StructureBarTerminationsData

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class BarTerminationsData : IDisposable
```
```vb
Public Class BarTerminationsData
	Implements IDisposable
```
```cpp
public ref class BarTerminationsData : IDisposable
```
```fsharp
type BarTerminationsData =
    class
        interface IDisposable
    end
```

The BarTerminationsData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BarTerminationsData | Creates a new instance of BarTerminationData with the default values. |

|  | Name | Description |
| --- | --- | --- |
|  | CrankTypeIdAtEnd | Identifies the crank type at the end of bar. Setting this property to a valid value, will set the HookTypeIdAtEnd and EndTreatmentTypeIdAtEnd to ElementId.InvalidElementId. |
|  | CrankTypeIdAtStart | Identifies the crank type at the start of bar. Setting this property to a valid value, will set the HookTypeIdAtStart and EndTreatmentTypeIdAtStart to ElementId.InvalidElementId. |
|  | EndTreatmentTypeIdAtEnd | Identifies the end treatment type at the end of bar. Setting this property to a valid value, will set the CrankTypeIdAtEnd and HookTypeIdAtEnd to ElementId.InvalidElementId. |
|  | EndTreatmentTypeIdAtStart | Identifies the end treatment type at the start of bar. Setting this property to a valid value, will set the CrankTypeIdAtStart and HookTypeIdAtStart to ElementId.InvalidElementId. |
|  | HookTypeIdAtEnd | Identifies the hook type at the end of bar. Setting this property to a valid value, will set the CrankTypeIdAtEnd and EndTreatmentTypeIdAtEnd to ElementId.InvalidElementId. |
|  | HookTypeIdAtStart | Identifies the hook type at the start of bar. Setting this property to a valid value, will set the CrankTypeIdAtStart and EndTreatmentTypeIdAtStart to ElementId.InvalidElementId |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | TerminationOrientationAtEnd | Identifies the orientation of the termination's (e.g. hook, crank) plane at the end of the bar with respect to the orientation of the last curve and the plane normal.Only two values are permitted: Value = Right: The termination is on your right as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up."Value = Left: The termination is on your left as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up."The default value is Left. |
|  | TerminationOrientationAtStart | Identifies the orientation of the termination's (e.g. hook, crank) plane at the start of the bar with respect to the orientation of the first curve and the plane normal.Only two values are permitted: Value = Right: The termination is on your right as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up."Value = Left: The termination is on your left as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up."The default value is Left. |
|  | TerminationRotationAngleAtEnd | Identifies the termination's (e.g. hook, crank) out of plane rotation angle (in radians) at the end of bar.The default value is 0. |
|  | TerminationRotationAngleAtStart | Identifies the termination's (e.g. hook, crank) out of plane rotation angle (in radians) at the start of bar.The default value is 0. |

|  | Name | Description |
| --- | --- | --- |
|  | AsRebarShapeTerminationsData | Creates a new instance of RebarShapeTerminationsData from this. |
|  | Dispose | Releases all resources used by the BarTerminationsData |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetDocument | Gets the document containing the hook type ids, end treatment ids and crank type ids. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Structure Namespace